<div style="font-size: 36px;">
COMS W4111 -- Introduction to Databases, Spring 2025<br>Lecture 3 Examples
</div>

# 1. Initialize Environment

In [52]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [53]:
db_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [54]:
# This is a hack to fix a version problem/incompatibility  with some of the packages and magics.
#
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [55]:
%sql $db_url

In [56]:
import pandas

In [57]:
from sqlalchemy import create_engine

In [58]:
engine = create_engine(db_url)

## Complex Attribute Examples

Derived attributes (columns)

In [73]:
%%sql

use S2025_examples;

drop table if exists s2025_examples.columbia_section;

create table if not exists s2025_examples.columbia_section
(
    callno       varchar(12)          not null
        primary key,
    course_no    varchar(12)          not null,
    section_no   varchar(3)           not null,
    semester     enum ('1', '2', '3') not null,
    section_year year                 not null,
    section_id   varchar(32) as (concat(`course_no`, _utf8mb4'_', `section_no`, _utf8mb4'_', `semester`, _utf8mb4'_',
                                        `section_year`)) stored,
    constraint columbia_section_id_pk
        unique (course_no, section_no, semester, section_year)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [75]:
%%sql

/*
    Note the use of the ENUM and YEAR datatypes, which we will cover later.
    Also note the use of ` and the concat function.
*/
insert into columbia_section(callno, course_no, section_no, semester, section_year)
    values("123456", "COMSW4111", "002", "1", "2025");

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [76]:
%sql select * from columbia_section;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('123456', 'COMSW4111', '002', '1', 2025, 'COMSW4111_002_1_2025')]

# 2. Loading Data Examples

There are several ways to load data files into an SQL database.

MySQL and other databases provide a ```LOAD DATA``` command (https://www.tutorialspoint.com/mysql/mysql_load_data.htm)

Many development tools for relational databases, including DataGrip, have data loading/import wizards.

For very large datasets, there are products that specialize in efficient loading.

In most cases in this class for simplicity we will use
- [Pandas](https://pandas.pydata.org/) "pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.."
- [SQLAlchemy](https://www.sqlalchemy.org/) "SQLAlchemy is the Python SQL toolkit and Object Relational Mapper that gives application developers the full power and flexibility of SQL."

In [77]:
%sql drop schema if exists lecture_3_examples
%sql create schema lecture_3_examples

 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [78]:
title_basics_df = pandas.read_csv("got_imdb_title_basics.csv")

In [79]:
title_basics_df.head(10)

,tconst,titleType,primaryName,originalName,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0054518,tvSeries,The Avengers,The Avengers,0,1961.0,1969.0,50.0,"Action,Comedy,Crime"
1,tt0054571,tvSeries,Three Live Wires,Three Live Wires,0,1961.0,NaN,30.0,Comedy
2,tt0055556,movie,"Two Living, One Dead","Two Living, One Dead",0,1961.0,NaN,105.0,"Crime,Drama,Thriller"
3,tt0056105,movie,The Swingin' Maiden,The Iron Maiden,0,1962.0,NaN,98.0,"Comedy,Romance"
4,tt0056696,movie,Young and Willing,The Wild and the Willing,0,1962.0,NaN,110.0,"Drama,Romance"
5,tt0057435,movie,The Punch and Judy Man,The Punch and Judy Man,0,1963.0,NaN,96.0,Comedy
6,tt0058142,movie,Girl with Green Eyes,Girl with Green Eyes,0,1964.0,NaN,91.0,"Drama,Romance"
7,tt0058596,movie,Smokescreen,Smokescreen,0,1964.0,NaN,70.0,"Crime,Drama,Mystery"
8,tt0059106,movie,Die! Die! My Darling!,Fanatic,0,1965.0,NaN,97.0,"Horror,Thriller"
9,tt0059191,tvEpisode,For the West,For the West,0,1965.0,NaN,75.0,Drama

In [80]:
title_basics_df.to_sql(
    "title_basics", schema="lecture_3_examples", con=engine, index=False, if_exists="replace"
)

29058

In [81]:
%sql select * from lecture_3_examples.title_basics limit 10

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('tt0054518', 'tvSeries', 'The Avengers', 'The Avengers', 0, 1961.0, 1969.0, 50.0, 'Action,Comedy,Crime'),
 ('tt0054571', 'tvSeries', 'Three Live Wires', 'Three Live Wires', 0, 1961.0, None, 30.0, 'Comedy'),
 ('tt0055556', 'movie', 'Two Living, One Dead', 'Two Living, One Dead', 0, 1961.0, None, 105.0, 'Crime,Drama,Thriller'),
 ('tt0056105', 'movie', "The Swingin' Maiden", 'The Iron Maiden', 0, 1962.0, None, 98.0, 'Comedy,Romance'),
 ('tt0056696', 'movie', 'Young and Willing', 'The Wild and the Willing', 0, 1962.0, None, 110.0, 'Drama,Romance'),
 ('tt0057435', 'movie', 'The Punch and Judy Man', 'The Punch and Judy Man', 0, 1963.0, None, 96.0, 'Comedy'),
 ('tt0058142', 'movie', 'Girl with Green Eyes', 'Girl with Green Eyes', 0, 1964.0, None, 91.0, 'Drama,Romance'),
 ('tt0058596', 'movie', 'Smokescreen', 'Smokescreen', 0, 1964.0, None, 70.0, 'Crime,Drama,Mystery'),
 ('tt0059106', 'movie', 'Die! Die! My Darling!', 'Fanatic', 0, 1965.0, None, 97.0, 'Horror,Thriller'),
 ('tt0059191', 'tvEpisode', 'For the West', 'For the West', 0, 1965.0, None, 75.0, 'Drama')]

In [82]:
%sql describe lecture_3_examples.title_basics

 * mysql+pymysql://root:***@localhost
9 rows affected.

[('tconst', 'text', 'YES', '', None, ''),
 (' titleType', 'text', 'YES', '', None, ''),
 (' primaryName', 'text', 'YES', '', None, ''),
 (' originalName', 'text', 'YES', '', None, ''),
 (' isAdult', 'bigint', 'YES', '', None, ''),
 (' startYear', 'double', 'YES', '', None, ''),
 (' endYear', 'double', 'YES', '', None, ''),
 (' runtimeMinutes', 'double', 'YES', '', None, ''),
 (' genres', 'text', 'YES', '', None, '')]

You can see that ```genres``` is multi-valued, and the individual values domain seems to be a fixed set of values, i.e. an ```ENUM.```

You can also infer that a ```title_basics``` has many ```genres``` and a ```genre``` may apply to several ```title_basics.``` $\Rightarrow$ We need an associative entity.

A better model is 

| <img src="multi-valued-erd.jpg"> |
| :---: |
| __Multi-Valued Attributes__ |

It would be relatively easy to write some python code that querie the table, splits the genre into a separate dataframe, creates a dataframe with the associations and write all of the entities to the database.

This approach works for relatively small datasets.

If the dataset is very large, this can be inefficient/expensive. The notebook and database are different programs running in different processes, perhaps on different machines $\Rightarrow$ That is a lot of data movement.

We will see that we can write SQL queries to accomplish the transformation in the databases, which will be much more efficient.
But this requires some additional concepts.

# 3. SQL Examples

## Unique Key Constraint

In [83]:
%sql use s2025_examples;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [84]:
%%sql
drop table if exists unique_example;

create table unique_example
(
    part1 int null,
    part2 int null,
    part3 int null,
    constraint unique_example_pk
        unique (part1, part2, part3)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

Let's do some testing, and also show how to access a database from an application. 

Some helper code.

In [85]:
%sql insert into unique_example values(1, 2, 3);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [86]:
%sql insert into unique_example values(1, 2, 3);

 * mysql+pymysql://root:***@localhost
(pymysql.err.IntegrityError) (1062, "Duplicate entry '1-2-3' for key 'unique_example.unique_example_pk'")
[SQL: insert into unique_example values(1, 2, 3);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

What if some of the columns are NULL?

In [87]:
%sql insert into unique_example values(1, 2, NULL);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [88]:
%sql insert into unique_example values(1, 2, NULL);

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [89]:
%sql select * from unique_example

 * mysql+pymysql://root:***@localhost
3 rows affected.

[(1, 2, None), (1, 2, None), (1, 2, 3)]

At first examination, that does not seem right. It looks like we have violated uniqueness. But remember ```NULL``` does not equal ```NULL.```

In [91]:
%%sql

select
    if ((1=1 and 2=2 and NULL=NULL), "Key is the same", "Key is NOT the same") as is_a_duplicate_key

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('Key is the same',)]

Some observations:
- ```NULL``` can be counter-intuitive but its behavior makes sense when we see more complex examples.
- You can put ```IF()``` and ```IFNULL()``` in the "project clause" to produce a conditional values.

## Check Constraint and ENUMs

In [94]:
%%sql

use s2025_examples;

drop table if exists section_enum;
drop table if exists section_check;

create table section_check 
                   (course_id varchar (8),
                    sec_id varchar (8),
                    semester varchar (6),
                    year numeric (4,0),
                    building varchar (15),
                    room_number varchar (7),
                    time_slot_id varchar (4), 
                    primary key (course_id, sec_id, semester, year),
                    check (semester in ('Fall', 'Winter', 'Spring', 'Summer')),
                   check ((room_number >= 0) AND (room_number <= 500)));


create table section_enum
(
    course_id    varchar(8),
    sec_id       varchar(8),
    semester     ENUM ('Fall', 'Winter', 'Spring', 'Summer'),
    year         numeric(4, 0),
    building     varchar(15),
    room_number  varchar(7),
    time_slot_id varchar(4),
    primary key (course_id, sec_id, semester, year)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

- How do these manifest?

In [95]:
%%sql

insert into section_check
    values ("W4111", "002", "Banana", 2025, "MATH", 207, "F1");

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (3819, "Check constraint 'section_check_chk_1' is violated.")
[SQL: insert into section_check
    values ("W4111", "002", "Banana", 2025, "MATH", 207, "F1");]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [96]:
%%sql

insert into section_enum
    values ("W4111", "002", "Banana", 2025, "MATH", 207, "F1");

 * mysql+pymysql://root:***@localhost
(pymysql.err.DataError) (1265, "Data truncated for column 'semester' at row 1")
[SQL: insert into section_enum
    values ("W4111", "002", "Banana", 2025, "MATH", 207, "F1");]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

In [102]:
%%sql

insert into section_check
    values ("W4113", "002", "Summer", 2025, "MATH", "501", "F1");

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (3819, "Check constraint 'section_check_chk_2' is violated.")
[SQL: insert into section_check
    values ("W4113", "002", "Summer", 2025, "MATH", "501", "F1");]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

- The error for the ENUM gives a strange message

## Data Type Example -- Date, Time

The [Classic Models Database](https://www.mysqltutorial.org/getting-started-with-mysql/mysql-sample-database/), which we will use during the semester, provides some examples.

| <img src="mysql-sample-database.png" width="700px;"> |
| :---: |
| __Classic Models Databases__ |

In [103]:
%sql use classicmodels;

%sql select * from orders limit 10;

 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
10 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128),
 (10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 18), datetime.date(2003, 1, 14), 'Shipped', None, 181),
 (10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 7), datetime.date(2003, 2, 2), 'Shipped', None, 121),
 (10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 9), datetime.date(2003, 2, 1), 'Shipped', None, 141),
 (10105, datetime.date(2003, 2, 11), datetime.date(2003, 2, 21), datetime.date(2003, 2, 12), 'Shipped', None, 145),
 (10106, datetime.date(2003, 2, 17), datetime.date(2003, 2, 24), datetime.date(2003, 2, 21), 'Shipped', None, 278),
 (10107, datetime.date(2003, 2, 24), datetime.date(2003, 3, 3), datetime.date(2003, 2, 26), 'Shipped', 'Difficult to negotiate with customer. We need more marketing materials', 131),
 (10108, datetime.date(2003, 3, 3), datetime.date(2003, 3, 12), datetime.date(2003, 3, 8), 'Shipped', None, 385),
 (10109, datetime.date(2003, 3, 10), datetime.date(2003, 3, 19), datetime.date(2003, 3, 11), 'Shipped', 'Customer requested that FedEx Ground is used for this shipping', 486)]

Why isn't ```orderDate``` just a ```CHAR(10)```?

In [104]:
%%sql

insert into orders(orderNumber, orderDate, status, customerNumber)
    values(10100, "Banana", "Shipped", 363)

 * mysql+pymysql://root:***@localhost
(pymysql.err.OperationalError) (1292, "Incorrect date value: 'Banana' for column 'orderDate' at row 1")
[SQL: insert into orders(orderNumber, orderDate, status, customerNumber)
    values(10100, "Banana", "Shipped", 363)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

We can also do some more advanced things with certain functions.

In [105]:
%%sql

select
    orderNumber,
    orderDate, shippedDate,
    datediff(shippedDate, orderDate) as time_to_ship_in_days
from orders limit 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 10), 4),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 11), 2),
 (10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 14), 4),
 (10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 2), 4),
 (10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 1), 1)]

In [106]:
%%sql

select
    orderNumber,
    orderDate,
    dayname(orderDate) as ordered_day_of_week,
    quarter(orderDate) as ordered_quarter
from orders
where quarter(orderDate)=2 and dayname(orderDate)="Friday"
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(10115, datetime.date(2003, 4, 4), 'Friday', 2),
 (10116, datetime.date(2003, 4, 11), 'Friday', 2),
 (10128, datetime.date(2003, 6, 6), 'Friday', 2),
 (10133, datetime.date(2003, 6, 27), 'Friday', 2),
 (10235, datetime.date(2004, 4, 2), 'Friday', 2),
 (10238, datetime.date(2004, 4, 9), 'Friday', 2),
 (10248, datetime.date(2004, 5, 7), 'Friday', 2),
 (10255, datetime.date(2004, 6, 4), 'Friday', 2),
 (10399, datetime.date(2005, 4, 1), 'Friday', 2),
 (10400, datetime.date(2005, 4, 1), 'Friday', 2)]

There are similar concepts for datetime, timestamp, ... and other domains.

## Common Table Expressions

Produce information on all of customer 363's orders that includes the information from ```customers, orders, orderdetails``` and ```products.```

In [107]:
%%sql

use classicmodels;

with one as (
   select customerNumber, customerName, orderNumber, status from customers join orders using(customerNumber)
),
    two as (
        select one.*, productCode, quantityOrdered from one join orderdetails using(orderNumber)
    ),
    three as (
        select two.*, productLine, productDescription from two join products using(productCode)
    )
select * from three where customerNumber=363
limit 5;

 * mysql+pymysql://root:***@localhost
0 rows affected.
5 rows affected.

[(363, 'Online Diecast Creations Co.', 10100, 'Shipped', 'S18_1749', 30, 'Vintage Cars', 'This 1:18 scale replica of the 1917 Grand Touring car has all the features you would expect from museum quality reproductions: all four doors and bi-fold hood opening, detailed engine and instrument panel, chrome-look trim, and tufted upholstery, all topped off with a factory baked-enamel finish.'),
 (363, 'Online Diecast Creations Co.', 10100, 'Shipped', 'S18_2248', 50, 'Vintage Cars', 'Features opening hood, opening doors, opening trunk, wide white wall tires, front door arm rests, working steering system.'),
 (363, 'Online Diecast Creations Co.', 10100, 'Shipped', 'S18_4409', 22, 'Vintage Cars', 'This 1:18 scale precision die cast replica features the 6 front headlights of the original, plus a detailed version of the 142 horsepower straight 8 engine, dual spares and their famous comprehensive dashboard. Color black.'),
 (363, 'Online Diecast Creations Co.', 10100, 'Shipped', 'S24_3969', 49, 'Vintage Cars', 'This model features grille-mounted chrome horn, lift-up louvered hood, fold-down rumble seat, working steering system and rubber wheels. Color black.'),
 (363, 'Online Diecast Creations Co.', 10192, 'Shipped', 'S12_4675', 27, 'Classic Cars', 'Detailed model of the 1969 Dodge Charger. This model includes finely detailed interior and exterior features. Painted in red and white.')]

You can break the task down into a set of simpler tasks.

Use common table expressions to add one task/query at a time.

I write my queries this way. When I give you complex examples, you will find using WITH makes things a lot easier.

WITH also makes it easier for the TAs and me to understand your query.

Understandability is an important consideration when writing a query.

"“Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live” John Woods.

## Some Subquery Examples

In [109]:
%sql use db_book;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [110]:
# Let's look at classrooms.
#
%sql select * from classroom;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('Packard', '101', Decimal('500')),
 ('Painter', '514', Decimal('10')),
 ('Taylor', '3128', Decimal('70')),
 ('Watson', '100', Decimal('30')),
 ('Watson', '120', Decimal('50'))]

In [111]:
%sql select * from section;

 * mysql+pymysql://root:***@localhost
15 rows affected.

[('BIO-101', '1', 'Summer', Decimal('2017'), 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', Decimal('2018'), 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', Decimal('2017'), 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', Decimal('2018'), 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', Decimal('2017'), 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', Decimal('2017'), 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', Decimal('2018'), 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', Decimal('2018'), 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', Decimal('2018'), 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', Decimal('2017'), 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', Decimal('2017'), 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', Decimal('2018'), 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', Decimal('2018'), 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', Decimal('2018'), 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', Decimal('2017'), 'Watson', '100', 'A')]

In [112]:
%%sql

/*
    Let's find the sections that are in a classroom with at least 70 seat capacity.
*/
select
    *,
    (select capacity from classroom where
        classroom.building=section.building and classroom.room_number=section.room_number) as room_capacity
from
    section
where
    (select capacity from classroom where
        classroom.building=section.building and classroom.room_number=section.room_number) >= 70;

 * mysql+pymysql://root:***@localhost
9 rows affected.

[('CS-101', '1', 'Fall', Decimal('2017'), 'Packard', '101', 'H', Decimal('500')),
 ('CS-101', '1', 'Spring', Decimal('2018'), 'Packard', '101', 'F', Decimal('500')),
 ('CS-190', '1', 'Spring', Decimal('2017'), 'Taylor', '3128', 'E', Decimal('70')),
 ('CS-190', '2', 'Spring', Decimal('2017'), 'Taylor', '3128', 'A', Decimal('70')),
 ('CS-319', '2', 'Spring', Decimal('2018'), 'Taylor', '3128', 'C', Decimal('70')),
 ('CS-347', '1', 'Fall', Decimal('2017'), 'Taylor', '3128', 'A', Decimal('70')),
 ('EE-181', '1', 'Spring', Decimal('2017'), 'Taylor', '3128', 'C', Decimal('70')),
 ('FIN-201', '1', 'Spring', Decimal('2018'), 'Packard', '101', 'B', Decimal('500')),
 ('MU-199', '1', 'Spring', Decimal('2018'), 'Packard', '101', 'D', Decimal('500'))]

A simple approach to student and advisor.

In [113]:
%%sql

select
    s_id as student_id,
    (select name from student where ID=s_id) as student_name,
    i_id as advisor_id,
    (select name from instructor where ID=i_id) as advisor_name
from  
    advisor;

 * mysql+pymysql://root:***@localhost
9 rows affected.

[('12345', 'Shankar', '10101', 'Srinivasan'),
 ('44553', 'Peltier', '22222', 'Einstein'),
 ('45678', 'Levy', '22222', 'Einstein'),
 ('00128', 'Zhang', '45565', 'Katz'),
 ('76543', 'Brown', '45565', 'Katz'),
 ('23121', 'Chavez', '76543', 'Singh'),
 ('98988', 'Tanaka', '76766', 'Crick'),
 ('76653', 'Aoi', '98345', 'Kim'),
 ('98765', 'Bourikas', '98345', 'Kim')]